{
  "title": "Mission Log",
  "subtitle": "Completed missions and battle record",
  "entries": [
    {
      "id": "1",
      "company": "HatchWorks Technologies",
      "position": "Senior Combat Engineer",
      "location": "Remote Ops",
      "startDate": "Jan 2021",
      "endDate": "Present",
      "type": "full-time",
      "description": "Deployed on the Reimagine strike team delivering JobStack 2.0 for TrueBlue with agile battle tactics and AWS weapon integrations. Leading hunter community initiatives and training rookies through the Buddy Program.",
      "achievements": [
        "Deployed JobStack 2.0 staffing platform with .NET microservices and React micro-frontends",
        "Conduct tactical interviews and contribute to recruitment protocols and best practices",
        "Lead Hatch-Futures Peru community and growth initiatives",
        "Part of AI Labs developing PoCs and demos with Python, FastAPI, GCP, React, NextJs"
      ],
      "technologies": [".NET", "React", "AWS", "PostgreSQL", "Docker", "Jenkins", "Hangfire"]
    },
    {
      "id": "2",
      "company": "Ministry of Energy & Mines",
      "position": "Mobile .NET Operative",
      "location": "Remote Ops",
      "startDate": "Sep 2025",
      "endDate": "Nov 2025",
      "type": "contract",
      "description": "Developed mobile battle apps to support Peru's informal-mining formalization campaign, including Transfer Registration and Enforcement applications for mineral transport traceability.",
      "achievements": [
        "Built Transfer Registration app to record mineral transport and generate QR codes",
        "Created Enforcement app to scan QR and persist records to cloud database",
        "Implemented CI/CD on on-premise servers using GitHub Actions self-hosted runners",
        "Designed end-to-end traceability workflow improving oversight for field inspectors"
      ],
      "technologies": [".NET 9", ".NET MAUI", "Oracle", "GitHub Actions", "Git"]
    },
    {
      "id": "3",
      "company": "Grodivo",
      "position": "Tech Commander (Co-Founder)",
      "location": "Remote Ops",
      "startDate": "Aug 2024",
      "endDate": "Present",
      "type": "founder",
      "description": "Co-founded Grodivo guild and led weapon development for TAP, a system to measure organizational culture. Designed microservices battle architecture and established combat coding standards.",
      "achievements": [
        "Co-founded the guild and led all weapon development initiatives",
        "Designed and implemented microservices and battle UI from scratch",
        "Established combat coding standards and CI/CD pipelines with GitHub Actions",
        "Built scalable AWS fortress with Lambda, SNS, SQS, S3"
      ],
      "technologies": [".NET 9", "React", "TypeScript", "AWS", "MediatR", "TurboRepo"]
    },
    {
      "id": "4",
      "company": "JNE (National Electoral Jury)",
      "position": "Senior Operative",
      "location": "Lima, Peru",
      "startDate": "Aug 2017",
      "endDate": "Dec 2020",
      "type": "full-time",
      "description": "Senior .NET operative on the SJE project as part of JNE's digital transformation campaign. Designed and deployed modules for electoral management and document archiving.",
      "achievements": [
        "Deployed modules for electoral management, registration, candidates, and authorities",
        "Developed WinForms app for document scanning with barcode recognition",
        "Improved system performance and security across electoral modules",
        "Built PDF document handling and inbox workflow systems"
      ],
      "technologies": ["ASP.NET MVC5", "WinForms", "WCF", "Oracle 11g", "jQuery", "AngularJS"]
    },
    {
      "id": "5",
      "company": "Pesonor S.A.C.",
      "position": "Field Operative",
      "location": "Peru",
      "startDate": "Nov 2018",
      "endDate": "Apr 2020",
      "type": "freelance",
      "description": "Developed industrial battle applications for weighing-services automation and integration with corporate command systems for major clients including Laredo S.A. and Casa Grande S.A.",
      "achievements": [
        "Built automation solutions for industrial weighing services",
        "Integrated with corporate command systems including Oracle and SQL Server",
        "Implemented TCP and RS-232 integrations with industrial devices",
        "Delivered reliable data capture systems for sugar industry clients"
      ],
      "technologies": [".NET Framework", "Oracle 11g", "SQL Server", "WinForms", "TCP/RS-232"]
    },
    {
      "id": "6",
      "company": "Proyectos Pesacon S.A.C.",
      "position": "Systems Commander",
      "location": "Peru",
      "startDate": "Oct 2013",
      "endDate": "Sep 2017",
      "type": "full-time",
      "description": "Commanded the systems division and development strike team for automation and traceability solutions in industrial weighing environments.",
      "achievements": [
        "APOLO: Built monitoring system for refinery weighing equipment (Nexa Resources)",
        "PESACON TRUCK: Developed multi-point truck weighing system with SAP data exchange",
        "PRODUCE: Created monitoring system for anchoveta capture with Ministry servers",
        "SOLDEXA: Implemented formulation system with industrial 920i integration"
      ],
      "technologies": ["WinForms", "C#", ".NET Framework", "SQL Server", "SAP RFC", "TCP/RS-232"]
    }
  ]
}
