{
  "title": "Conquered Stages",
  "subtitle": "Boss battles won and stages cleared",
  "categories": {
    "all": "All Stages",
    "enterprise": "Enterprise",
    "startup": "Startup",
    "government": "Government",
    "industrial": "Industrial",
    "fullstack": "Full-Stack"
  },
  "noProjects": "No stages found in this zone.",
  "modal": {
    "highlights": "Key Battle Tactics",
    "technologies": "Weapon Systems Used"
  },
  "entries": [
    {
      "id": "1",
      "title": "JobStack 2.0",
      "description": "Enterprise staffing battle platform for TrueBlue with microservices architecture, React micro-frontends, and AWS weapon integrations.",
      "longDescription": "Led the assault on JobStack 2.0, a comprehensive staffing platform for TrueBlue. Built with .NET microservices and React micro-frontends, featuring Hangfire for background operations, Amazon Aurora (PostgreSQL) for data persistence, and extensive AWS weapon integrations including SNS, SQS, CloudFormation for infrastructure as code.",
      "highlights": [
        "Microservices architecture with .NET",
        "React micro-frontends",
        "AWS integrations (SNS, SQS, CloudFormation)",
        "CI/CD with Jenkins & Octopus Deploy"
      ]
    },
    {
      "id": "2",
      "title": "TAP - Organizational Culture System",
      "description": "SaaS battle platform to measure and analyze organizational culture, built from scratch as a guild co-founder.",
      "longDescription": "Co-founded Grodivo guild and led the development of TAP, a system to measure organizational culture. Designed the entire battle architecture including .NET 9 microservices, React frontend with TypeScript and Styled Components, and AWS serverless fortress with Lambda, SNS, SQS, SES, and S3.",
      "highlights": [
        "Built from scratch as guild co-founder",
        "Serverless AWS fortress architecture",
        "MediatR for CQRS battle pattern",
        "Monorepo with TurboRepo"
      ]
    },
    {
      "id": "3",
      "title": "Mining Traceability Apps",
      "description": "Mobile battle apps for Peru's Ministry of Energy and Mines to track mineral transport with QR code generation and scanning.",
      "longDescription": "Developed two .NET MAUI mobile battle applications to support Peru's informal-mining formalization campaign. The Transfer Registration app records mineral transport and generates QR codes, while the Enforcement app allows field operatives to scan and validate records against cloud databases.",
      "highlights": [
        "Cross-platform mobile apps with .NET MAUI",
        "QR code generation and scanning",
        "Offline-first with cloud sync",
        "CI/CD with self-hosted runners"
      ]
    },
    {
      "id": "4",
      "title": "SJE - Electoral Management System",
      "description": "Digital transformation campaign for JNE (National Electoral Jury) with electoral management and document archiving modules.",
      "longDescription": "Senior operative on the SJE project as part of JNE's digital transformation campaign. Designed and deployed modules for electoral management, registration, candidates, authorities, and document archiving. Built a WinForms application for document scanning with barcode recognition integrated with FTP and cloud services.",
      "highlights": [
        "Electoral management modules",
        "Document archiving with barcode recognition",
        "PDF generation and handling",
        "Security and performance improvements"
      ]
    },
    {
      "id": "5",
      "title": "APOLO - Refinery Weighing Monitor",
      "description": "Administration and monitoring system for refinery weighing equipment at Cajamarquilla (Nexa Resources).",
      "longDescription": "Led development of APOLO, a comprehensive monitoring system for industrial weighing equipment at the Cajamarquilla refinery operated by Nexa Resources. The system provides real-time monitoring, administration, and reporting capabilities for critical weighing operations in the mining and refinery sector.",
      "highlights": [
        "Real-time equipment monitoring",
        "Industrial device integration",
        "Critical operations reporting",
        "Mining sector implementation"
      ]
    },
    {
      "id": "6",
      "title": "PESACON TRUCK",
      "description": "Multi-point truck weighing system with SAP data exchange, migrated from VB6 to modern .NET.",
      "longDescription": "Developed PESACON TRUCK, a multi-point truck weighing system that integrates with SAP for real-time data exchange. The project involved migrating from legacy VB6 codebase to modern .NET Framework while maintaining integration with industrial weighing equipment through TCP and RS-232 protocols.",
      "highlights": [
        "SAP integration via RFC",
        "Multi-point weighing coordination",
        "Legacy VB6 migration",
        "Industrial protocol support"
      ]
    }
  ]
}
